Repository: Sasha-hk/petryk
Catalog: src/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Name
ru: Имя

source: Email
ru: Электронная почта

source: Your message
ru: Ваше сообщение

source: Petryk Oleksandr
ru: Петрик Александр

source: Country: Ukraine
ru: Страна: Украина

source: Level: Junior
ru: Уровень: Junior

source: About me
ru: Обо мне

source: As you can already understand, I am a programmer, I develop sites. At first I just liked writing code, but later I realized that I wanted to do serious programming, therefore I continued to study, and reached present level. I love learning something new, and I do it well. I lead a healthy lifestyle, I have no bad habits, I like to spend time actively. I take into account the interests of others, so I usually do not cause trouble, I find common ground with others quickly enough, I know how to work in a team.
ru: Как вы уже понимаете, я программист, занимаюсь разработкой сайтов. Сначала мне просто нравилось писать код, но позже я понял, что хочу заниматься серьезным программированием, поэтому продолжил учиться и достиг нынешнего уровня. Я люблю узнавать что-то новое, и у меня это хорошо получается. Веду здоровый образ жизни, не имею вредных привычек, люблю активно проводить время. Я учитываю интересы других, поэтому обычно не доставляю хлопот, достаточно быстро нахожу точки соприкосновения с другими, умею работать в команде.

source: Languages
ru: Языки которые я знаю

source: English / B1
ru: Aнглийский / B1

source: Russian / native
ru: Русский / родной

source: Ukranian / native
ru: Украинский / родной

source: Since I live in Ukraine, I know the Ukrainian language, also I also know Russian. As for the English language, I really like it, so I study it by listening to music, watching movies and the like.
ru: Поскольку я живу в Украине, я знаю украинский язык, а также русский язык. Что касается английского языка, мне он очень нравится, поэтому я изучаю его, слушая музыку, просматривая фильмы и тому подобное.

source: My skills
ru: Мои навыки

source: These two technologies were my first in web development, I have been studying them since 2019. So I can do almost anything with their help.
ru: Эти две технологии были моими первыми в веб-разработке, я изучаю их с 2019 года. Так что с их помощью я могу делать практически все, что угодно.

source: I have been studying JavaScript since 2021. With it I can create complex elements of interaction on the site. I don't know any JS framework, but I'm working on fixing it.
ru: Я изучаю JavaScript с 2021 года. С его помощью я могу создавать сложные элементы взаимодействия на сайте. Я не знаю никакой JS framework, но я работаю над тем чтобы исправить это.

source: My first programming language was Python, I liked it so I started to study it in depth. I use Django to write the backend part of the site.
ru: Моим первым языком программирования был Python, он мне понравился, поэтому я начал его углубленно изучать. Я использую Django для написания серверной части сайта.

source: I've always liked Linux, so I recently started studying it, I use it to configure VPS servers for my projects. I also use Linux as the main OS.
ru: Мне всегда нравился Linux, поэтому я недавно начал его изучать, использую эти знания для настройки серверов VPS для своих проектов. Я также использую Linux в качестве основной ОС.

source: Problem-solving capability
ru: Способность решать проблемы

source: I like to approach the problem wisely, I believe that this way of solving problems characterizes a good specialist.
ru: Я люблю подходить к проблеме с умом, считаю, что такой способ решения проблем характеризует хорошего специалиста.

source: Mathematical skills
ru: Математические навыки

source: I do not know higher mathematics, but I have good logic, it allows me to perform tasks that require knowledge of mathematics, if I do not know something, I learn it quickly.
ru: Я не знаю высшей математики, но у меня хорошая логика, она позволяет мне выполнять задания, требующие знания математики, если я чего-то не знаю, я быстро это выучиваю.

source: Intresting facts
ru: Интересные факты

source: I like a bicycle
ru: Я люблю кататься на велосипеде

source: I can solve a Rubik's cube
ru: Я могу собрать Кубик Рубика

source: I love a music
ru: Я люблю музыку

source: I drink a lot of tea
ru: Я пью много чая

source: Gallery
ru: Галерея

source: Contact
ru: Контакт

source: With any questions and suggestions write to me!
ru: С любыми вопросами и предложениями пишите мне!

source: send message
ru: Отправить

source: home
ru: главная

source: about me
ru: обо мне

source: my works
ru: мои работы

source: contact
ru: связываться

source: Web developer
ru: Веб разработчик

source: I develop both simple websites and complex web applications
ru: Разрабатываю как простые сайты, так и сложные веб-приложения

source: write to me
ru: Напишите мне

source: Photo of Oleksandr
ru: Фото Александра

source: What is my goal?
ru: Какая у меня цель?

source: My goal is to create quality and efficient web applications.
ru: Моя цель - создавать качественные и эффективные веб-приложения.

source: I pay a lot of time and attention to site planning and configuration, as a result the site is easier to maintain and modify.
ru: Я уделяю много времени и внимания планированию и настройке сайта, в результате сайт легче поддерживать и изменять.

source: My last works
ru: Мои последние работы

source: I made this site myself, including the design I did myself
ru: Я сделал этот сайт сам, включая дизайн, который сделал сам

source: SVG images take up much less memory than PNG
ru: Изображения SVG занимают гораздо меньше памяти, чем PNG
