Repository: Sasha-hk/petryk
Catalog: petryk/locale/*/LC_MESSAGES/django.po
Languages: uk

source: Name
uk: Ім'я

source: Email
uk: Електронна адреса

source: Your message
uk: Ваше повідомлення

source: Petryk Oleksandr
uk: Петрик Олександр

source: Age: 17 yeats old
uk: Вік: 17 років

source: Contry: Ukraine
uk: Країна: Україна

source: Level: Junior
uk: Рівень: Junior

source: About me
uk: Про мене

source: As you can already understand, I am a programmer, I develop sites. At first I just liked writing code, but later I realized that I wanted to do serious programming, therefore I continued to study, and reached his present level. I love learning something new, and I do well. In general, I lead a healthy lifestyle, I have no bad habits, I like to spend time actively. I take into account the feelings and interests of others, so I usually do not cause trouble, I find common ground with others quickly enough, I know how to work in a team.
uk: Як ви вже могли зрозумітиф, я програміст, займаюсь розроюкою сайтів.Мені просто подобалось писати код, але згодом я зрозумів що хочу займатись програмуванням, тому я продовжував навчатись, і дойшов до свого теперішнього рівня.Мені подобається вчитись чомусь новому, і в мене це досить непогано вихолить. Я веду здоровий спосіб життя, у мене неміє шкідливих звичок, люблю активно проводити час. Я зважаю на почуття та інтереси інших, тому не сприченяю неприємностей, швидко знаходжу спільну мову з іншими, вмію працювати в команді.

source: Languages
uk: Мови що я знаю

source: English / B1
uk: Англійська / B1

source: Russian / native
uk: Російська / рідна

source: Ukranian / native
uk: Українська / рідна

source: Since I live in Ukraine, I know the Ukrainian language, also I also know Russian. As for the English language, I really like it, so I study it by listening to music, watching movies and the like.
uk: Оскільки я живу в Україні, то я знаю українську мову, також знаю російську. Щодо англійської мови, мені вона дуже подобається, тому я вивчаю її, слухаючи музику, дивлячись фільми, читию книго тощо.

source: My skills
uk: Мої навички

source: These two technologies were my first in web development, I have been studying them since 2019. So I can do almost anything with their help.
uk: Ці дві технології були моїми першими у веб -розробці, я вивчаю їх з 2019 року. Тому я можу зробити майже все що завгодно з їхньою допомогою.

source: I have been studying JavaScript since 2021. With it I can create complex elements of interaction on the site. I don't know any JS structure, but I'm working on fixing it.
uk: Я вивчаю JavaScript з 2021 року. З його допомогою я можу створювати складні елементи взаємодії на сайті. Я не знаю жодного JS framework, але я працюю над тим щоб виправити це.

source: My first programming language was Python, I liked it so I started to study it in depth. I use Django to write the backend part of the site.
uk: Моєю першою мовою програмування був Python, він мені сподобався тому я розпочав поглиблено вивчати його.Я використовую Django щоб писати backend частини сайтів.

source: I've always liked Linux, so I recently started studying it, I use it to configure VPS servers for my projects. I also use Linux as the main OS.
uk: Мені завжди подобався Linux, тому я нещодавно почав його вивчати, використовую здобуті знання для налаштування VPS серверів, для своїх проектів. Я також використовую Linux як основну ОС.

source: Problem-solving capability
uk: Здатність усувати пробдеми

source: I like to approach the problem wisely, I believe that this way of solving problems characterizes a good specialist.
uk: Я люблю з розумом підходити до вирішення проблеми, я думаю що саме такий підхід характерезуєдоброго спеціаліста.

source: Mathematical skills
uk: Знання математики

source: I do not know higher mathematics, but I have good logic, it allows me to perform tasks that require knowledge of mathematics, if I do not know something, I learn it quickly.
uk: Я не знаю вищої математики, але маю хорошу логіку, це дозволяє мені виконувати завдання, що вимагають знань з математики, якщо я чогось не знаю, то я швидко це вивчаю.

source: Intresting facts
uk: Цікаві факти

source: I like a bicycle
uk: Я люблю кататись на велосипеді

source: I can solve a Rubik's cube
uk: Я вмію складати Кубіка Рубіка

source: I love a music
uk: Я люблю музику

source: I drink a lot of tee
uk: Люблю пити багато чаю

source: Gallery
uk: Галерея

source: Write to me
uk: Напишіть мені

source: If you want to cooperate or ask
uk: Якщо ви хочете співпрацювати або запитати у мене

source: something - write to me!
uk: щось, тоді напишіть мені!

source: send message
uk: Відправити

source: Email:
uk: Електронні адреса:

source: Phone:
uk: Номер телефону:

source: home
uk: Головна

source: about me
uk: Про мене

source: my works
uk: Мої роботи

source: contact
uk: Звязатися

source: Web developer
uk: Веб розробник

source: I develop both simple websites and complex web applications
uk: Я займаюсь розробкою як не великих сайтів, так і складніх веб додатків.

source: write to me
uk: напешіть мені

source: Photo of Oleksandr
uk: Фото Олександра

source: What is my goal?
uk: Яка моя ціль?

source: My goal is to create quality and efficient web applications, from scratch.
uk: Моя ціль - це створювати якісні та ефективні вею сайти.

source: I pay a lot of time and attention to site planning and configuration, as a result the site is easier to maintain and modify.
uk: Я приділяю багато часу і уваги плануванню і налаштуванню проекта, в результатісайт легше підтримувати і модефікувати.

source: My last works
uk: Мої останні роботи

source: I made this site myself, including the design I did myself
uk: Я створив цей сайт власноруч, включно з дизайном.

source: SVG images take up much less memory than PNG
uk: SVG зображення займають менше пім'яті ніж PNG зображення
